tests/load/dashboard.yml
config:
  target: "http://localhost:8080"
  phases:
    - name: "Warm up"
      duration: 30
      arrivalRate: 5
    - name: "Sustained load"
      duration: 120
      arrivalRate: 50
    - name: "Spike"
      duration: 30
      arrivalRate: 200
  defaults:
    headers:
      Authorization: "Bearer {{ $processEnvironment.TEST_JWT }}"
      Content-Type: "application/json"
  thresholds:
    - http.response_time.p95: 500    # 95th percentile < 500ms
    - http.response_time.p99: 1000   # 99th percentile < 1s
    - http.codes.200: 99.5           # 99.5% success rate
    - errors.rate: 0.5               # <0.5% error rate

scenarios:
  - name: "Dashboard load"
    flow:
      - get:
          url: "/dashboard/summary"
          expect:
            - statusCode: 200
            - contentType: json
  - name: "Log activity"
    flow:
      - post:
          url: "/activities"
          json:
            kind: "transport"
            mode: "car_petrol"
            distanceKm: 15
            passengers: 1
          expect:
            - statusCode: 201